//
//  ViewTwoController.swift
//  manee
//
//  Created by Phudit Chuengjaroen on 6/3/15.
//  Copyright (c) 2015 Phudit Chuengjaroen. All rights reserved.
//

import Foundation
import UIKit
import Social

class ViewTwoController: UIViewController,FBSDKLoginButtonDelegate {
    
    //Variable
    var messages = ""
    var lastCaption:String = ""
    var two = 2
    
    @IBOutlet weak var navigationBar: UINavigationBar!
    @IBOutlet weak var lblLoginStatus: UILabel!
    @IBOutlet weak var number: UILabel!
    @IBOutlet weak var forecast: UILabel!
    @IBOutlet weak var fbName: UILabel!
    @IBOutlet weak var ShareView: UIView!
    @IBOutlet weak var LoginView: UIView!
    
    @IBAction func shareButton(sender: UIButton) {
        var share = messages
        let activityVC:UIActivityViewController = UIActivityViewController(activityItems: [share], applicationActivities: nil)
        self.presentViewController(activityVC, animated: true, completion: nil)
        println(share)
    }
    
    @IBAction func fbPost(sender: AnyObject) {
        if SLComposeViewController.isAvailableForServiceType(SLServiceTypeFacebook){
            var controller:SLComposeViewController = SLComposeViewController(forServiceType: SLServiceTypeFacebook)
            controller.setInitialText(messages+"\n"+lastCaption)
            self.presentViewController(controller, animated: true, completion: nil)
        }
        else{
            //println("no Facebook account found on device")
            var alert = UIAlertController(title: "Accounts", message: "Please login to a Facebook account to share.", preferredStyle: UIAlertControllerStyle.Alert)
            alert.addAction(UIAlertAction(title: "OK", style: UIAlertActionStyle.Default, handler: nil))
            self.presentViewController(alert, animated: true, completion: nil)
        }
    }
    
    @IBAction func twitPost(sender: AnyObject) {
        if SLComposeViewController.isAvailableForServiceType(SLServiceTypeTwitter){
            var con:SLComposeViewController = SLComposeViewController(forServiceType: SLServiceTypeTwitter)
            con.setInitialText(messages+"\n"+lastCaption)
            self.presentViewController(con, animated: true, completion: nil)
        }
        else{
            var alert = UIAlertController(title: "Accounts", message: "Please login to a Twitter account to share.", preferredStyle: UIAlertControllerStyle.Alert)
            alert.addAction(UIAlertAction(title: "OK", style: UIAlertActionStyle.Default, handler: nil))
            self.presentViewController(alert, animated: true, completion: nil)
        }
    }
    
    
    func changeRand() ->Int{
        var numb:Int = Int(arc4random()%28+1)
        //println(numb)
        //println(message(numb))
        return numb
    }
    
    func message(number: Int) ->String{
        messages = "เซียมซีใบที่ \(number)"
        switch number{
        case 1:
            println("1")
            lastCaption = "ใบที่หนึ่งสมมาตรปรารถนา\n"+"ทายไว้ว่ามีคนชุบอุปถัมภ์\n"+"หมายสิ่งใดในจิตคิดจะทำ\n"+"ว่าจักสำเร็จการประมาณมี\n"+"แต่ช้าๆ จึงจะสมอารมณ์ปอง\n"+"ทิ้งพวกพ้องปรีเปรมเกษมศรี\n"+"ว่าอยู่เย็นเป็นสุขทุกเดือนปี\n"+"แม้นใบนี้ถามโรคร้ายที่โศกกาย\n"+"ว่าคงจะเบาบางเหมือนอย่างว่า\n"+"หรือถามหาลูกหนี้พี่น้องหาย\n"+"ว่าคงจะพบประสบพักตร์เหมือนทักทาย\n"+"หรือถามหมายหาลาภไม่หยาบคำ\n"+"ว่าช้าๆ คงจะสมอารมณ์นึก\n"+"ได้ตรองตริกเหล่ากอเป็นข้อขำ\n"+"ถามหาคู่ดีนักเหมือนชักนำ\n"+"ขอจบคำที่หนึ่งรำพิงเอยฯ"
        case 2:
            println("2")
            lastCaption = "ใบที่สองต้องกันเหมือนจันทร์ฉาย \nเปรียบกับต้นพฤกษาคราที่ตาย\nแล้วกลับกลายได้เป็นเหมือนเช่นเดิม\nได้ผลิตอกออกใบไสวสว่าง\nต้องน้ำค้างลมเชยรำเพยเสริม\nเหมือนกระจกบานเก่าเมื่อคราวเดิม\nต้องเพิ่มเติมขัดถูจึงดูงาม\nจะทำการสิ่งใดพร้อมใจกัน\nจงผ่อนผันหารือนับถือถาม\nคงสมจิตสมปองทำนองความ\nใบนี้ถามคนไข้ว่าได้คลาย\nถามลูกหนี้พวกพ้องว่าต้องพบ\nถามเรื่องคู่รู้จบไม่สมหมาย\nถามหาลาภว่าดีพาทีทาย\nจบภิปรายเลขที่สองทำนายเอยฯ"
            //forecast.text = lastCaption
        case 3:
            println("3")
            lastCaption = "ใบที่สามความยากลำบากล้น\n"+"จะทำการเคืองขุ่นวุ่นรำคาญตน\n"+"ว่าทั้งคนทั้งปัญหามารุมกัน\n"+"ต้องอุตสาห์อดกลั้นอย่าเสียขวัญ\n"+"จงแข็งขันอย่าลดคลายคิดเหหัน\n"+"แต่ถามว่าเป็นความไม่คร้ามกัน\n"+"คงผ่อนผันสู้ได้เป็นไรมี\n"+"จะไปหาผู้ใดก็ไม่ยาก\n"+"ถามลูกหนี้ที่จากพลัดพรากหนี\n"+"ว่ายังไม่พบกันในทันที\n"+"ถามลาภมีคงยากลำบากกาย\n"+"ถามหาคู่สู่สมภิรมย์พักตร์\n"+"ว่ายังจักแชเชือนไม่เหมือนหมาย\n"+"จงสงบไว้ก่อนค่อยผ่อนคลาย\n"+"หมดทำทายที่สามเนื้อความเอยฯ"
        case 4:
            println("4")
            lastCaption = "ใบที่สี่นี้ไชร์เหมือนไกลคู่\n"+"มิได้รู้ประพบประสบสอง\n"+"เหมือนลูกไก่ฝูงเดียวเที่ยวคนอง\n"+"ตัวหนึ่งต้องพลัดพรากจากไกลกัน\n"+"ต่อนานจึงจะพบประสบพักตร์\n"+"ได้สมศักดิ์สุขีเป็นศรีสันต์\n"+"จะทำการสิ่งใดพร้อมใจครัน\n"+"แต่ข้อนั้นทายไว้ที่ในที\n"+"อย่าดำเนินเดินหน้าท่านว่าร้าย\n"+"เราต้องหมายตามหลังระวังหนี\n"+"เหมือนพระจันทร์ร่อนเร่ขึ้นเมฆี\n"+"พระแสงศรีสุริยงต้องลงดิน\n"+"ถามคนเจ็บว่าหายสบายจิต\n"+"ถ้าต้องคิดเป็นความตามกระสินธ์\n"+"คงชนะเจียวหนาอย่าราคิน\n"+"แม้นถามถิ่นคนลี้หลบหนีกาย\n"+"ยังไม่พบประสบพักตร์\n"+"ถามลูกรักในครรภ์เหมือนมั่นหมาย\n"+"ว่าคงรู้เห็นว่าเป็นชาย\n"+"จบคำทายที่สี่เท่านี้เอยฯ"
        case 5:
            println("5")
            lastCaption = "ใบที่ห้าว่าไว้ในอักษร\n"+"ไม่มีใครทำร้ายขจายจร\n"+"อย่าทุกข์ร้อนไปเลยไม่เคยการ\n"+"ถ้ารักนักมักได้ควายของเขา\n"+"ม้าของเราจะต้องพรากจากสถาน\n"+"ถ้าจะคบคนผู้ใดให้ดูการ\n"+"ถือบุราณแบบเก่าอย่าเบาความ\n"+"แม้นถามหาเนื้อคู่ว่าอยู่ไกล\n"+"ยังไม่ได้เหมือนจิตจงคิดขาม\n"+"ถามลูกหนี้หนีไปในใจความ\n"+"จะติดตามไม่พบประสบกัน\n"+"ถามหาลาภนี้ไชร์ก็ได้ยาก\n"+"ต้องลำบากทุกข์ร้อนจงผ่อนผัน\n"+"แม้นถามบุตรสุดใจที่ในครรภ์\n"+"เลขห้านั้นว่าเป็นหญิงทุกสิ่งเอยฯ"
        case 6:
            println("6")
            lastCaption = "ใบที่หกโชคดีเป็นศรีสันต์\n"+"จะทำการสิ่งใดได้ทุกอัน\n"+"คงสมขวัญสมสุขทุกปราการ\n"+"ถามหาคู่ร่วมเรียงไว้เคียงห้อง\n"+"ว่าได้คล่องหนักหนาฟังว่าขาน\n"+"แสนจะสุขทุกอย่างทางกันดาร\n"+"ไม่พบพานประพบประสบเลย\n"+"ทั้งคนเจ็บก็หายสบายด้วย\n"+"คงไม่ม้วยชีวานะท่านเอ๋ย\n"+"หมออยู่ทิศอุดรแต่ก่อนเคย\n"+"ไม่ละเลยคงจะมารักษาเรา\n"+"ใครขอได้ใบนี้เป็นที่ชื่น\n"+"ความทุกข์อื่นห่างไกลไม่โฉดเขลา\n"+"จงถวายเงินตราค่าของเรา\n"+"อุทิศเข้าทำบุญในวัดสวัสดีเอยฯ"
            //forecast.text = lastCaption
        case 7:
            println("7")
            lastCaption = "ใบที่เจ็ดเสร็จทุกข์เป็นสุขี\n"+"ทั้งบ้านเรือนเพื่อนกินก็ยินดี\n"+"แต่ตัวเรานี้เคืองขุ่นดูวุ่นวาย\n"+"จงทำบุญให้ทานประมาณจิต\n"+"คงสมคิดแสนสมอารมณ์หมาย\n"+"อย่าอ้อมโอบโลภมากจะยากกาย\n"+"ฟังภิปรายพาทีคงดีจริง\n"+"เหมือนปลูกต้นผลไม้ไว้ใกล้บ้าน\n"+"คงเป็นการอยู่สุขลิ้นทุกสิ่ง\n"+"ถามหาลาภใบนี้ว่าดีจริง\n"+"หรือถามสิ่งของหายว่าได้คืน\n"+"ถามหาคู่สู่สมภิราณ์พักตร์\n"+"ว่าดีนักแสนดีเป็นที่ชื่น\n"+"ถามคนเจ็บว่าหายสบายคืน\n"+"ถามเรื่องอื่นก็ดีเท่านี้เอยฯ"
        case 8:
            println("8")
            lastCaption = "ใบที่แปดนี้ไชร์แม้นได้สม\n"+"คงชื่นชมสุขีเป็นที่สอง\n"+"เปรียบเหมือนตันพฤษามณทาทอง\n"+"รากแก้วต้องขาดไปอยู่ไม่ทน\n"+"เวลานี้ก็แล้งต้องแบ่งรับ\n"+"จงเปลื่ยนกลับย้ายที่จึงมีผล\n"+"ถามของหายหายากลำบากค้น\n"+"ถามหาคนปราถนาจะได้สมอารมณ์ตน\n"+"ถ้ารำพึงถึงลาภจงทราบเถิด\n"+"ไม่ประเสริฐอย่าได้เคืองเรื่องลาภผล\n"+"ใบที่แปดแม้นความมีคดีพ้น\n"+"หมดนิพนธ์สำคัญเท่านั้นเอยฯ"
        case 9 :
            println("9")
            lastCaption = "ใบที่เก้าเล่าชิดตัวมัจฉา\n"+"จะกลายเป็นมังกรเหมือนก่อนมา\n"+"คิดไปหาลาภผลด้วยกลได\n"+"ทิศทักษิณทิศปราจิมริมวิถี\n"+"ว่าไปดีมาดีเป็นศรีใส\n"+"เปรียบเหมือนนาวาที่คลาไคล\n"+"ได้แล่นใบไปตามลมค่อยสมปอง\n"+"ว่ามังกรกับงูยังรู้แปลง\n"+"เหมือนนาแล้งวิดน้ำสักสองสาม\n"+"คงจะได้ฟุ้งเฟืองน้ำเนืองนอง\n"+"ถามคนต้องพลัดพรากจากไป\n"+"ว่าคงจะพบประสบพักตร์\n"+"ถามคู่รักร่วมชิดพิตสมัย\n"+"ว่ายังไม่ได้กันในทันใด\n"+"ถามคนไข้ว่าหายเบาบางลง\n"+"ถามหาลาภใบนี้ว่าดีนัก\n"+"คงสมศักดิ์สมจิตคิดประสงค์\n"+"จงอุตสาห์หมั่นทำในจำนงค์\n"+"ที่เก้าคงว่าดีเท่านี้เอยฯ"
        case 10:
            lastCaption = "ใบที่สิบชี้เช่นเป็นความยาก\n"+"ถึงมีปากพูดไปก็ไว้ผล\n"+"เหมือนคนใบ้ได้แต่คิดจิตเวียนวน\n"+"จะบอกบ่นการใดไม่เข้าใจความ\n"+"ให้หมั่นเล็งเพ่งพิศพนิจเหตุ\n"+"คอยสังเกตุให้ทราบอย่าอยาบหยาม\n"+"เห็นดีแท้แก้ไขกรรมที่งาม\n"+"จะสมความคิดไว้ได้ในทันใด\n"+"ถามถึงบุตรในครรภ์ตามจริงเป็นหญิงชัด\n"+"ถามของพลัดหมดดีไม่มีหวัง\n"+"บอกว่าหายทายไว้ให้เชื่อฟัง\n"+"ไม่คืนหลังดังคิดในจิดใจ\n"+"ถามถึงไข้โรคที่ป่วยเจ็บ\n"+"ว่าเบ็ดเสร็จหายได้อย่าสงสัย\n"+"ถามถึงคู่ว่าได้ชมสมหทัย\n"+"ถามหาลาภยังไม่ดีเป็นที่คลาย\n"+"รักษาสุขภาพกายใจให้มั่นทุกวันเอยฯ"
        case 11:
            lastCaption = "ใบที่สิบเอ็ดเหมือนกับพระจันทร์ฉาย\n"+"ขี่เมฆปิดมั่นไม่ผันผาย\n"+"เมฆลอยห่างจึงสว่างนวลกระจาย\n"+"มีประกายรัศมีศรีงดงาม\n"+"ชาติปางก่อนทำเท่าไรได้เท่านั้น\n"+"พอสมกันสมบูรณ์พอพูนเพิ่ม\n"+"ไปข้างหน้าว่าดีทวีเติม\n"+"แม้ความเดิมแม่ลูกได้ถูกกัน\n"+"ทำสิ่งหนึ่งสิ่งใดคงได้สม\n"+"ถามคู่ชมว่าดีเป็นศรีสันต์\n"+"ถามลูกหนี้พวกพ้องพี่น้องกัน\n"+"จงผ่อนผันจะได้สมอารมณ์ปอง\n"+"ถามหาลาภว่าดีเป็นที่ยิ่ง\n"+"ถามทุกสิ่งสู้ความว่างามผ่อง\n"+"ดีทั้งนั้นใบนี้เหมือนสีทอง\n"+"จงตรึกตรองอ่อนน้อมให้พร้อมเอยฯ"
        case 12:
            lastCaption = "ใบที่สิบสองคนหนึ่งเดินไปข้างหน้า\n"+"คนหนึ่งเดินตามหลังมาทั้งสอง\n"+"เปรียบเหมือนกับคนใบ้มีใจปอง\n"+"พูดไม่คล่องแสนยากลำบากครัน\n"+"ว่าจะมีคนชุปอุปถัมภ์\n"+"เหมือนถ้อยคำพาทีคนที่ฝัน\n"+"เวลาตื่นหายไปร้อนใจพลัน\n"+"ให้ป่วนปั่นเปล่าๆ ไม่เข้าการ\n"+"ถามหาคู่สู่สมภิรมณ์พักตร์\n"+"ว่าสมศักดิ์แสนสมอารมณ์ขาน\n"+"ถามเป็นความว่าดีไม่มีปาน\n"+"ถามถึงการเพื่อนรักปประจักษ์ใจ\n"+"ว่าคงจะสมอารมณ์นึก\n"+"ที่ตื้นลึกจักแจ้งแถลงไข\n"+"พบพี่ป้าลุงน้าเพื่อนจรุงใจ\n"+"ถามหาลาภไม่สู้ดีเท่านี้เอยฯ\n"
        case 13:
            lastCaption = "ใบที่สิบสามเปรียบตนเหมือนต้นไม้\n"+"ยังมิได้ผลิดอกหรือออกผล\n"+"ดังรุกขาหน้าแล้งต้องแฝงตน\n"+"เพราะน้ำฝนจะโปรยปรายยังไม่มี\n"+"อย่าถูกต้องน้ำค้างที่กลางแจ้ง\n"+"อย่าเคลื่อบแคลงจากไปให้ไกลที่\n"+"จงรอรั้งฟังว่าคำพาที\n"+"แม้นการมีค่อยติดตามกิจการ\n"+"จึงจะไม่เสียเรื่องให้เคื่องแค้น\n"+"ถ้ามาตรแม้นขอบุตรสุดสงสาร\n"+"ว่ายังไม่มีมาในอาการ\n"+"ถามพบพานพวกพ้องพี่น้องดี\n"+"ถามหาลาภว่าสมอารมณ์หมาย\n"+"ถามถึงรายเรื่องคู่นั้นจู้จี้\n"+"ว่ายังไม่ได้กันในทันที\n"+"จบใบที่สิบสามสิ้นความเอยฯ\n"
        case 14:
            lastCaption = "ใบที่สิบสี่นี้ว่าเหมือนฟ้าดิน\n"+"ยังราคินต่างๆระคางเขิน\n"+"จะไปหาผู้ใดให้เผอิญ\n"+"เป็นการเกินประตูปิดมิดชิดบัง\n"+"จะเรียกร้องก็ขามให้คร้ามจิต\n"+"เราต้องคิดคอยก่อนฟังสอนสั่ง\n"+"อย่ารีบร้อนคอยทีเป็นสัจจง\n"+"จะมีหวังสมเหตุ เจตนา\n"+"ด้วยโชคชะตาจำเพาะผสมส่ง\n"+"ไม่เวียนวนคงได้วิไลหนา\n"+"ถามหาคู่ร่วมเรียงเคียงกายา\n"+"คู่ชีวาเคืองขุ่นดูวุ่นวาย\n"+"ถามเพื่อนฝูงน้องพี่ลูกหนี้นั้น\n"+"ว่าพบกันแสนสมอารมณ์หมาย\n"+"ถามหาลาภยังไม่ดีพาทีทาย\n"+"ถามคนไข้ว่าได้คลายเท่านี้เอยฯ\n"
        case 15:
            lastCaption = "ใบที่สิบห้าว่าไว้ไม่เหมือนนึก\n"+"จะทำการสิ่งใดให้ตรองตรึก\n"+"ทั้งตื้นลึกหนาบางเยี่ยงอย่างมา\n"+"จงฝักไฝ่ไต่ถามซึ่งพ่อแม่\n"+"ผู้เฒ่าแก่หารืออย่าถือสา\n"+"ค่อยๆตรองคงสมปองสักเวลา\n"+"นานข้างหน้าคงจะสวยรุ่มรวยครัน\n"+"เวลานี้เพียงทายไว้แค่กำชับ\n"+"ยังสับปรับกลับกลายคล้ายจังหัน\n"+"สุดแต่ลมหมุนมาก็พากัน\n"+"จิตป่วนปั่นตามลมระบมไป\n"+"ใครขอได้ใบนี้จงตรองตรึก\n"+"คำตื้นลึกมีอยู่หนาฟังปราศรัย\n"+"ค่อยปรึกษาตรองดูอยู่ร่ำไป\n"+"คงรวยใหญ่แน่หนาฟังว่าเอยฯ\n"
        case 16:
            lastCaption = "ใบที่สิบหกว่าสมอารมณ์นึก\n"+"คงพบพักตร์คนชุปอุปถัมภ์\n"+"กับคนที่มีบุญการุณย์ธรรม\n"+"เสมอร่ำๆไปด้วยใจดี\n"+"ว่าข้างหน้าจะถาวรเจริญสุข\n"+"ไม่มีทุกข์ขุ่นข้องหม่นหมองศรี\n"+"จะสมความปราถนาเหมือนพาที\n"+"แม้นใบนี้ถามไข้ว่าได้คลาย\n"+"ถามหาคู่สู่สมภิรมย์พักตร์\n"+"ว่าสมศักดิ์แสนสมอารมณ์หมาย\n"+"ถามหาลาภก็ว่าดีพาทีทาย\n"+"หรือถามหมายเป็นความไม่ลามลวน\n"+"คงจะสู้ได้แท้เป็นแน่นัก\n"+"ถึงจะชักไชร้หรือไต่สวน\n"+"จงตอบต่อข้อความตามกระบวน\n"+"ขบจบถ้วนใบนี้ว่าดีเอยฯ\n"
        case 17:
            lastCaption = "ใบที่สิบเจ็ดไม่เสร็จเหมือนใจหมาย\n"+"คิดทำกิจเคืองขุ่นดูวุ่นวาย\n"+"จะกลับกลายเป็นร้ายให้หวั่นเกรง\n"+"อย่าใจร้อนไปเลยใครครวญนึก\n"+"ค่อยๆตรึกจงเจาะให้เหมาะเหม็ง\n"+"คงสมหมายสมชื่นได้ครึ้นเครง\n"+"ดังเราเองต้องเตรียมระวังตัว\n"+"เขามีแต่เชือดเนื้อเถือหนังเราทั้งสิ้น\n"+"จะผันผินมองแผลมีแต่ชั่ว\n"+"ถามคนเจ็บว่าหายสบายตัว\n"+"หรือพันพัวเรื่องความที่ถามมา\n"+"คงชนะทั้งสิ้นอย่ากินแหนง\n"+"ถามเคลือบแคลงลูกหนี้ไม่ดีหนา\n"+"ทั้งเพื่อนฝูงก็ไม่พบประสบตา\n"+"แต่ถามหาลาภแสนเลิศจะเกิดมีเอยฯ\n"
        case 18:
            lastCaption = "ใบที่สิบแปดว่าไว้ในอักษร\n"+"ไม่อาวรณ์สิ่งใดที่ทำหนอ\n"+"สโมสรสมคิดจิตพะนอ\n"+"ไม่มีท้อการค้าขายย่อมไปดี\n"+"ถามบุตรว่าเป็นชายอยู่ในท้อง\n"+"คงสมปองคู่เชยชมสมศักดิ์ศรี\n"+"ถามของหายหาได้ไม่ราคี\n"+"ลาภก็ดีมีสุขทุกคืนวัน\n"+"ถามคนไข้ก็หายสบายจิต\n"+"ลูกหนี้ชิดเคียงกายอย่าไหวหวั่น\n"+"ใครขอได้ใบนี้แสนดีครัน\n"+"คงสุขสันต์เริงระรื่นชื่นช่ำเอยฯ\n"
        case 19:
            lastCaption = "ใบที่สิบเก้าเกิดมาเป็นมนุษย์\n"+"เวลาดีก็แสนดีเป็นที่สุด\n"+"จงยั้งหยุดตรึกตรองทำนองการ\n"+"ช้าช้าหน่อยคงสมอารมณ์ปอง\n"+"ทั้งพวกพ้องปรีดิ์เปรมเกษมศานต์\n"+"อยู่จนแก่จนคร่ำไม่รำคาญ\n"+"แม้นถามการเจ็บกายว่าหายดี\n"+"ถามหาลาภก็ได้เหมือนใจนึก\n"+"จะครึ้นครึกเปลื้องทุกข์เป็นสุขี\n"+"ถามเป็นความนั้นไชร้ไม่สู้ดี\n"+"ถามถึงที่ไปมาจะหาใคร\n"+"ก็ไม่สมอารมณ์ไว้เหมือนในจิต\n"+"สุดจะคิดจะแจ้งแถลงไข\n"+"แต่ปลายมือว่าดีไม่มีภัย\n"+"ขอจบใบที่สิบเก้าเท่านี้เอยฯ\n"
        case 20:
            lastCaption = "ใบที่ยี่สิบนี้ไชร้ว่าไกลนัก\n"+"เราสุดจักแลเห็นที่เช่นของ\n"+"อีกสักหน่อยจึงสมอารมณ์ปอง\n"+"ม้าตัวทองคอยท่าข้างหน้ามี\n"+"คงได้พบคนชุปอุปถัมภ์\n"+"ทั้งคมขำดีนักเป็นศักดิ์ศรี\n"+"คงสมความตามจิตที่คิดดี\n"+"แม้นใบนี้ถามไข้ว่าได้คลาย\n"+"ถามไปไหนก็ดีเป็นที่ยิ่ง\n"+"สิ้นทุกสิ่งคงสมอารมณ์หมาย\n"+"ถามอะไรก็ให้ดูที่รู้ถาม\n"+"ได้สมความวายทุกข์เป็นสุขี\n"+"ใบนี้หนาจัดว่าเป็นใบดี\n"+"แต่เป็นความนี้สู้ยากลำบากเอยฯ\n"
        case 21:
            lastCaption = "ใบที่ยี่สิบเอ็ดชูชุปเหมือนปุบผา\n"+"ต้องลมแดดแผดส่องทำนองมา\n"+"แต่ทว่าไม่แห้งอย่าแหนงเลย\n"+"เหมือนลูกนกสอนบินเที่ยวผินผัน\n"+"ถูกลมหันพลัดตกโอ้อกเอ๋ย\n"+"แต่ข้างหน้ารื่นรมย์ได้ชมเชย\n"+"คงสะเบยแสนสบายไม่วายวัน\n"+"ถามคนเจ็บว่าเขาบรรเทาจิต\n"+"ถามหามิตรคู่ชมภิรมณ์ขวัญ\n"+"ว่ายังอยู่ห่างไกลไม่ได้กัน\n"+"ถามความนั้นสู้ยากลำบากกาย\n"+"แต่มีลาภบ้างเหมือนอย่างทาย\n"+"คงสมหมายปรีดิ์เปรมเกษมศานต์\n"+"ใครขอได้ใบนี้แม้นมีการ\n"+"ไม่ช้านานคงสมอารมณ์เอยฯ\n"
        case 22:
            lastCaption = "ใบที่ยี่สิบสองต้องตามหลังเขา\n"+"จะทำการสิ่งใดอย่าใจเบา\n"+"ตัวของเราต้องหาปรึกษาการ\n"+"ให้มีผู้ชี้แจงแสดงกิจ\n"+"คงสมคิดดอกหนาฟังว่าขาน\n"+"อย่าเป็นทุกข์ไปเลยไม่เคยการ\n"+"ถือโบราณเอาไว้คงจะได้ดี\n"+"ถามคนเจ็บว่าหายเหมือนทายทัก\n"+"ว่าคงจักพ้นทุกข์เป็นสุขี\n"+"ถามเป็นความท่านดูไม่สู้ดี\n"+"ถามลาภมีมากมายเหมือนหมายปอง\n"+"ถามไปหาผู้ใดที่ในจิต\n"+"คงสมคิดแสนสมภิรมย์สอง\n"+"ใครขอได้ใบนี้เหมือนสีทอง\n"+"ยี่สิบสองจบกันเท่านั้นเอยฯ\n"
        case 23:
            lastCaption = "ใบที่ยี่สิบสามความดีเป็นศรีสุข\n"+"ถึงใครต้องเจ็บไข้อย่าได้ทุกข์\n"+"คงเป็นสุขทั้งบ้านเรือนไม่เคลื่อนคลาย\n"+"ทั้งจะมีลาภด้วยอย่างวยงง\n"+"สมประสงค์แสนสมอารมณ์หมาย\n"+"ไปทางไกลได้ตามความสบาย\n"+"แม้นถามหมายสิ่งใดคงได้การ\n"+"ถามคนเจ็บว่าหายสบายจิต\n"+"แม้นถามติดเรื่องความที่ตามศาล\n"+"คงชนะเป็นแท้แน่แก่การ\n"+"เกษมศานต์แสนสมอารมณ์ปอง\n"+"ถามหาลาภก็ดีเป็นที่ยิ่ง\n"+"สิ้นทุกสิ่งดีพร้อมไม่มัวหมอง\n"+"เหมือนโกสุมบุปผามณทาทอง\n"+"ในทำนองใบนี้ว่าดีเอยฯ\n"
        case 24:
            lastCaption = "ใบที่ยี่สิบสี่ดีแท้แน่นักหนา\n"+"ด้วยเมื่อคราวตกระกำลำบากมา\n"+"คนจะมาชูช่วยอำนวยพร\n"+"ว่าอยู่ทิศบูรพารักษาท่าน\n"+"จะมอบขวัญมอบเงินตราค่าสลอน\n"+"ทั้งคนป่วยก็หายวายทุกข์ร้อน\n"+"มีแต่ผ่อนความสุขทุกราตรี\n"+"ถามหาคู่สู่สมภิรมย์สนิท\n"+"อยู่ใกล้ทิศทางปราจิมริมวิถี\n"+"แสนรุ่มรวนสวยนักประจักษ์มี\n"+"ปานเศรษฐีพูนทรัพย์นับประมาณ\n"+"ถามถึงบุตรสุดใจในครรภ์ด้วย\n"+"ว่าแสนสวยเป็นชายหนาตามที่ถาม\n"+"อยากรู้สิ่งใดได้สมตาม\n"+"ขอจบสารยี่สิบสี่เท่านี้เอยฯ\n"
        case 25:
            lastCaption = "ใบที่ยี่สิบห้าว่าไว้ในอักษร\n"+"เหมือนเรือเล็กไคลคลากลางสาคร\n"+"พายุต้องทวนลมผจญภัย\n"+"จะข้ามฝากก็ยากลำบากยิ่ง\n"+"จะทำการทุกสิงให้ทุ่มแรงและกายใจ\n"+"แม้นถามการไปมาจะคลาไคล\n"+"ท่านบอกไว้ตามคำที่ทำนาย\n"+"ทิศทักษิณปราจิมริมวิถี\n"+"หนทางนี้ควรท่านจะผันผาย\n"+"ถามคนเจ็บพอทุเลาเบากาย\n"+"ถ้าถามหมายจะพึ่งใครยังไม่มี\n"+"ถามหาลาภไม่ควรเสี่ยงมิสมหมาย\n"+"ถามของเคลื่อนหายไปจากในที่\n"+"สุดแสนยากจะพบประสบมี\n"+"แต่เป็นความว่าดีเท่านี้เอยฯ\n"
        case 26:
            lastCaption = "ใบที่ยี่สิบหกเปรียบใกล้ดอกไม้บาน\n"+"ถึงมีการทุกข์ร้อนจงผ่อนผัน\n"+"สุดแม้แต่บุญกรรมเป็นสำคัญ\n"+"ตัวเรานั้นต้องเจียมเสงี่ยมตัว\n"+"จะทำการสิ่งใดอย่าได้หาญ\n"+"ขืนรำคาญอึกอักว่าจักชั่ว\n"+"ต่อภายหลังจะต้องความหมองมัว\n"+"คิดถึงตัวถึงกายไม่วายวัน\n"+"เปรียบเหมือนเราปลูกต้นผลไม้\n"+"คนอื่นได้เก็บกินไม่ผินผัน\n"+"แม้นถามบุตรสุดใจที่ในครรภ์\n"+"ว่าคนนั้นเป็นหญิงอย่างจริงใจ\n"+"ถามเป็นความว่าเห็นเป็นอย่างกลาง\n"+"ถามคนเจ็บว่าห่างกระจ่างใส\n"+"ถามหาลาภได้ยากลำบากใจ\n"+"ขอจบใบนี้พลันเท่านั้นเอยฯ\n"
        case 27:
            lastCaption = "ใบที่ยี่สิบเจ็ดเสร็จสมอารมณ์หมาย\n"+"เปรียบเหมือนต้นรุกขาเวลาตาย\n"+"ต้องสาดสายน้ำค้างในเวลากลางคืน\n"+"แตกใบอ่อนได้จริงทุกกิ่งก้าน\n"+"ก็เหมือนการสาวหนุ่มได้ชุมชี่น\n"+"คงสมคิดอยู่บ้างอยู่ยั่งยืน\n"+"บ้านเรื่อนรื่นสุขียินดีครัน\n"+"แม้นถามเป็นความไม่ขามเข็ด\n"+"ชนะเสร็จดับร้อนได้ผ่อนผัน\n"+"ถามหาลาภใบนี้ว่าดีครัน\n"+"คนเจ็บนั้นว่าหายสบายเบา\n"+"ทั้งคนเหมาะสงเคราะห์ก็มีอยู่\n"+"เหมือนบุญชูช่วยให้พบประสบเขา\n"+"จบอภิปรายคำทายใบสำเนา\n"+"ต้องจัดเอาว่าดีเท่านี้เอยฯ\n"
        case 28:
            lastCaption = "ใบที่ยี่สิบแปดบอกความไปตามคิด\n"+"สองสามจิตตรึกตรองทำนองหมาย\n"+"ไปข้างหน้าว่าดีพาทีทาย\n"+"คงสมหมายสมปองทำนองใน\n"+"ภูเขาสูงน้ำลึกจงตรึกตรา\n"+"สุริยาส่องแจ้งดูแสงใส\n"+"คนดีอยู่เคียงข้างไม่ห่างไกล\n"+"คงจะได้สมคิดเหมือนจิตจง\n"+"แม้นใบนี้ถ้าถามเป็นความกัน\n"+"อันนั้นว่าร้ายนะอย่าประสงค์\n"+"ถามคนที่เจ็บซ้ำในจำนงค์\n"+"ท่านบอกตรงว่าหนักเหมือนทักทาย\n"+"ถามหาลาภใบนี้ว่าดีแท้\n"+"ถามคนแน่ที่เหมาะสงเคราะห์หมาย\n"+"มีอยู่ด้วยนั่งเรียงมาเคียงกาย\n"+"จบคำทำนายพาทีเท่านี้เอยฯ\n"
        default:
            println("others")
        }
        forecast.text = lastCaption
        return messages
    }
    
    func isUserLogin(status:String)-> Bool {
        if(status == "yes"){
            return true
        }else{
            return false
        }
    }
    
    override func viewDidLoad() {
        super.viewDidLoad()
        //initialize navigation
        //navigationBar.frame.origin.y = -10
        navigationBar.titleTextAttributes = [NSForegroundColorAttributeName: UIColor.orangeColor()]
        
        //set text
        self.number.text = String(message(changeRand()))
        
        // Do any additional setup after loading the view, typically from a nib.
        
        //Facebook Logged in?
        if (FBSDKAccessToken.currentAccessToken() != nil)
        {
            // User is already logged in, do work such as go to next view controller.
            println("Login Already!")
            returnUserData()
            
            let content : FBSDKShareLinkContent = FBSDKShareLinkContent()
            content.contentURL = NSURL(string: "https://www.facebook.com/phuditnut")
            content.contentTitle = "manee ziamzee welcome!"
            content.contentDescription = lastCaption
            
            let button : FBSDKShareButton = FBSDKShareButton()
            button.shareContent = content
            ShareView.frame = CGRectMake(50, 637, 240, 50)
            ShareView.addSubview(button)
            
        } else {
            let shareButton : FBSDKLoginButton = FBSDKLoginButton()
            LoginView.addSubview(shareButton)
            //LoginView.center = self.view.center
            LoginView.frame = CGRectMake(20, 505, 109, 49)
            shareButton.readPermissions = ["public_profile", "email", "user_friends"]
            shareButton.delegate = self
        }

    }
    
    // Facebook Delegate Methods
    
    func loginButton(loginButton: FBSDKLoginButton!, didCompleteWithResult result: FBSDKLoginManagerLoginResult!, error: NSError!) {
        println("User Logged In")
        isUserLogin("yes")
        if ((error) != nil)
        {
            // Process error
        }
        else if result.isCancelled {
            // Handle cancellations
        }
        else {
            // If you ask for multiple permissions at once, you
            // should check if specific permissions missing
            if result.grantedPermissions.contains("email")
            {
                // Do work
            }
        }
    }
    
    func loginButtonDidLogOut(loginButton: FBSDKLoginButton!) {
        println("User Logged Out")
    }
    
    //Get user data from Facebook api
    func returnUserData() {
        lblLoginStatus.text = "You are currently Logged in as "
        let graphRequest: FBSDKGraphRequest = FBSDKGraphRequest(graphPath: "me", parameters: nil)
        graphRequest.startWithCompletionHandler({(connection, result, error) -> Void in
            let id: NSString = result.valueForKey("id") as!NSString
            println("id is: \(id)")
            let Name: NSString = result.valueForKey("name") as!NSString
            self.fbName.text = Name as String
            //self.name.text = Name as String
            let gender: NSString = result.valueForKey("gender") as!NSString
            println("User gender is: \(gender)")
            let userEmail: NSString = result.valueForKey("email") as!NSString
            println("User Email is: \(userEmail)")
        })
    }
}
